; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-3-5-155)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p2-0 - location
	p1-0 - location
	p1-2 - location
	p3-0 - location
	p3-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s2)
	(at driver5 s0)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s2)
	(at package2 s2)
	(at package3 s4)
	(at package4 s1)
	(at package5 s4)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 39)
	(= (time-to-walk p2-0 s2) 39)
	(= (time-to-walk s0 p2-0) 38)
	(= (time-to-walk p2-0 s0) 38)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 81)
	(= (time-to-walk p1-0 s1) 81)
	(= (time-to-walk s0 p1-0) 62)
	(= (time-to-walk p1-0 s0) 62)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 44)
	(= (time-to-walk p1-2 s1) 44)
	(= (time-to-walk s2 p1-2) 78)
	(= (time-to-walk p1-2 s2) 78)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 5)
	(= (time-to-walk p3-0 s3) 5)
	(= (time-to-walk s0 p3-0) 73)
	(= (time-to-walk p3-0 s0) 73)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 27)
	(= (time-to-walk p3-2 s3) 27)
	(= (time-to-walk s2 p3-2) 73)
	(= (time-to-walk p3-2 s2) 73)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 64)
	(= (time-to-drive s0 s2) 64)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 72)
	(= (time-to-drive s1 s2) 72)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 74)
	(= (time-to-drive s4 s2) 74)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 68)
	(= (time-to-drive s2 s3) 68)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 77)
	(= (time-to-drive s0 s1) 77)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 84)
	(= (time-to-drive s3 s1) 84)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 75)
	(= (time-to-drive s4 s0) 75)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver3 s1)
	(at driver4 s0)
	(at driver5 s3)
	(at truck1 s2)
	(at truck2 s4)
	(at truck3 s3)
	(at package2 s2)
	(at package3 s2)
	(at package4 s4)
	(at package5 s2)
	))

(:metric minimize (+ (* 1 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver5 s0 p3-0)
   deleted: (at driver5 s0)
   added: (at driver5 p3-0)
   goals met: 2 of 11
2. (walk driver1 s1 p1-2)
   deleted: (at driver1 s1)
   added: (at driver1 p1-2)
   goals met: 2 of 11
3. (walk driver1 p1-2 s2)
   deleted: (at driver1 p1-2)
   added: (at driver1 s2)
   goals met: 3 of 11
4. (walk driver5 p3-0 s3)
   deleted: (at driver5 p3-0)
   added: (at driver5 s3)
   goals met: 4 of 11
5. (walk driver4 s2 p2-0)
   deleted: (at driver4 s2)
   added: (at driver4 p2-0)
   goals met: 4 of 11
6. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 11
7. (walk driver4 p2-0 s0)
   deleted: (at driver4 p2-0)
   added: (at driver4 s0)
   goals met: 4 of 11
8. (drive-truck truck2 s2 s4 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (fuel-used) from 0 to 740
   goals met: 5 of 11
9. (load-truck package3 truck2 s4)
   deleted: (at package3 s4)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 11
10. (load-truck package5 truck2 s4)
   deleted: (at package5 s4)
   added: (in package5 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 5 of 11
11. (drive-truck truck2 s4 s2 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 740 to 1702
   goals met: 4 of 11
12. (unload-truck package3 truck2 s2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 5 of 11
13. (drive-truck truck2 s2 s1 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 1702 to 2494
   goals met: 5 of 11
14. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 5 of 11
15. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 2494 to 3430
   goals met: 5 of 11
16. (unload-truck package5 truck2 s2)
   deleted: (in package5 truck2)
   added: (at package5 s2)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 6 of 11
17. (board-truck driver5 truck1 s3)
   deleted: (at driver5 s3) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 5 of 11
18. (drive-truck truck1 s3 s2 driver5)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 3430 to 4110
   goals met: 6 of 11
19. (drive-truck truck2 s2 s4 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (fuel-used) from 4110 to 4924
   goals met: 7 of 11
20. (disembark-truck driver5 truck1 s2)
   deleted: (driving driver5 truck1)
   added: (at driver5 s2) (empty truck1)
   goals met: 7 of 11
21. (walk driver5 s2 p3-2)
   deleted: (at driver5 s2)
   added: (at driver5 p3-2)
   goals met: 7 of 11
22. (walk driver5 p3-2 s3)
   deleted: (at driver5 p3-2)
   added: (at driver5 s3)
   goals met: 8 of 11
23. (walk driver4 s0 p2-0)
   deleted: (at driver4 s0)
   added: (at driver4 p2-0)
   goals met: 7 of 11
24. (walk driver4 p2-0 s2)
   deleted: (at driver4 p2-0)
   added: (at driver4 s2)
   goals met: 7 of 11
25. (board-truck driver4 truck3 s2)
   deleted: (at driver4 s2) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 7 of 11
26. (drive-truck truck3 s2 s3 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 4924 to 5604
   goals met: 8 of 11
27. (disembark-truck driver4 truck3 s3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s3) (empty truck3)
   goals met: 8 of 11
28. (walk driver4 s3 p3-0)
   deleted: (at driver4 s3)
   added: (at driver4 p3-0)
   goals met: 8 of 11
29. (drive-truck truck2 s4 s2 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 5604 to 6418
   goals met: 7 of 11
30. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 8 of 11
31. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 11
32. (unload-truck package4 truck2 s2)
   deleted: (in package4 truck2)
   added: (at package4 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 7 of 11
33. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 7 of 11
34. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 6418 to 7232
   goals met: 6 of 11
35. (walk driver3 s1 p1-2)
   deleted: (at driver3 s1)
   added: (at driver3 p1-2)
   goals met: 5 of 11
36. (walk driver4 p3-0 s0)
   deleted: (at driver4 p3-0)
   added: (at driver4 s0)
   goals met: 6 of 11
37. (walk driver3 p1-2 s2)
   deleted: (at driver3 p1-2)
   added: (at driver3 s2)
   goals met: 6 of 11
38. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 6 of 11
39. (drive-truck truck1 s4 s2 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 7232 to 8046
   goals met: 7 of 11
40. (drive-truck truck2 s2 s4 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (fuel-used) from 8046 to 8786
   goals met: 8 of 11
41. (disembark-truck driver3 truck2 s4)
   deleted: (driving driver3 truck2)
   added: (at driver3 s4) (empty truck2)
   goals met: 8 of 11
42. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 8786 to 9600
   goals met: 7 of 11
43. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 7 of 11
44. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 11
45. (drive-truck truck1 s4 s0 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 9600 to 10425
   goals met: 7 of 11
46. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 7 of 11
47. (walk driver3 s0 p1-0)
   deleted: (at driver3 s0)
   added: (at driver3 p1-0)
   goals met: 7 of 11
48. (walk driver3 p1-0 s1)
   deleted: (at driver3 p1-0)
   added: (at driver3 s1)
   goals met: 8 of 11
49. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 8 of 11
50. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 10425 to 11250
   goals met: 8 of 11
51. (unload-truck package4 truck1 s4)
   deleted: (in package4 truck1)
   added: (at package4 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 9 of 11
52. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 9 of 11
53. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 9 of 11
54. (drive-truck truck1 s4 s2 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 11250 to 11990
   goals met: 10 of 11
55. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 11 of 11
